In [32]:
import pandas as pd
import numpy as np

try:
    df_excel = pd.read_excel('./planilhas/dataEx.xlsx', 
    )
except Exception as ex:
    print(ex.args)

df_excel

    Aluno  Nota P1  Nota P2   N1  Nota P3  Nota P4   N2  Resultado
0   Lucas      8.5      2.0  2.0      2.0      2.0  2.0        2.0
1   Lucas      8.5      2.0  2.0      2.0      2.0  2.0        2.0
2   Lucas      8.5      5.0  5.0      5.0      5.0  5.0        5.0
3  Felipe      9.8      8.8  8.8      8.8      8.8  8.8        8.8

In [33]:
print('Lenght Dataframe before: ', len(df_excel))

df_excel.drop_duplicates(keep=False,inplace=True)

df_excel

Lenght Dataframe before:  4

    Aluno  Nota P1  Nota P2   N1  Nota P3  Nota P4   N2  Resultado
2   Lucas      8.5      5.0  5.0      5.0      5.0  5.0        5.0
3  Felipe      9.8      8.8  8.8      8.8      8.8  8.8        8.8

In [34]:
df_excel = df_excel.reset_index()
df_excel.set_index('index',inplace=True)
df_excel

        Aluno  Nota P1  Nota P2   N1  Nota P3  Nota P4   N2  Resultado
index
2       Lucas      8.5      5.0  5.0      5.0      5.0  5.0        5.0
3      Felipe      9.8      8.8  8.8      8.8      8.8  8.8        8.8

In [35]:
import pandas as pd

df = pd.read_csv('./csvs/dataCS.csv', sep=';')
email_list = df['Email'].tolist()
print(df)
email_list

             Email      Nome  Notas
0  lucasrochaf2018     Lucas     85
1   Luisrochaf2020      Luis     31
2       Pedrof2022     Pedro     48
3        Eddief018     Eddie     11
4           fera89  Fernando     27

['lucasrochaf2018', 'Luisrochaf2020', 'Pedrof2022', 'Eddief018', 'fera89']

In [36]:
for index, row in df_excel.iterrows():
    Student = str(row['Aluno'])

In [37]:
df.set_index('Email', inplace=True)

In [43]:

import math
df_email_result = pd.DataFrame(columns=['Email', 'Notas'])
df_email_result.reset_index()

df_email_result.at[0, 'Email'] = ''
df_email_result.at[0, 'Notas'] = 0


for index, row in df.iterrows():
    student = str(row['Nome'])
    email = row.name
    result = df_excel['Resultado'].where(student == df_excel['Aluno'])[2]
    if not math.isnan(result):
        index = df_email_result.index[-1]
        df_email_result.at[index, 'Email'] = email
        df_email_result.at[index, 'Notas'] = result

             Email Notas
0  lucasrochaf2018   5.0